IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ECAP7_CONTROLSS_ECAP7.xml
<module name="CONTROLSS_ECAP7_CONTROLSS_ECAP7" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_ECAP7_TSCTR" acronym="CONTROLSS_ECAP7_TSCTR" offset="0x0" width="32" description="">
		<bitfield id="TSCTR" width="32" begin="31" end="0" resetval="0x0" description="Active 32-bit counter register that is used as the capture time-base HR mode : 1)  This register reads HRCOUNTER value and is not writable 2)  can be reset using CTRFILTRESET 3)  Its not  synchronized to SYSCLK domain so reads may not be accurate" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP7_CTRPHS" acronym="CONTROLSS_ECAP7_CTRPHS" offset="0x4" width="32" description="">
		<bitfield id="CTRPHS" width="32" begin="31" end="0" resetval="0x0" description="Counter phase value register that can be programmed for phase lag/lead. This register CTRPHS is loaded into TSCTR upon either a SYNCI event or S/W force via a control bit. Used to achieve phase control synchronization with respect to other eCAP and EPWM time-bases.  This register is not applicable in HR mode." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP7_CAP1" acronym="CONTROLSS_ECAP7_CAP1" offset="0x8" width="32" description="">
		<bitfield id="CAP1" width="32" begin="31" end="0" resetval="0x0" description="This register can be loaded (written) by: - Time-Stamp counter value (TSCTR) during a capture event - Software - may be useful for test purposes or initialization - ARPD shadow register (CAP3) when used in APWM mode" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP7_CAP2" acronym="CONTROLSS_ECAP7_CAP2" offset="0xC" width="32" description="">
		<bitfield id="CAP2" width="32" begin="31" end="0" resetval="0x0" description="This register can be loaded (written) by: - Time-Stamp ( counter value) during a capture event - Software - may be useful for test purposes - ACMP shadow register (CAP4) when used in APWM mode" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP7_CAP3" acronym="CONTROLSS_ECAP7_CAP3" offset="0x10" width="32" description="">
		<bitfield id="CAP3" width="32" begin="31" end="0" resetval="0x0" description="In CMP mode, this is a time-stamp capture register.   In APWM mode, this is the period shadow (APRD) register. You can update the PWM period value through this register. CAP3 (APRD) shadows CAP1 in this mode." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP7_CAP4" acronym="CONTROLSS_ECAP7_CAP4" offset="0x14" width="32" description="">
		<bitfield id="CAP4" width="32" begin="31" end="0" resetval="0x0" description="In CMP mode, this is a time-stamp capture register.   In APWM mode, this is the compare shadow (ACMP) register. You can update the PWM compare value via this register. CAP4 (ACMP) shadows CAP2 in this mode." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP7_ECCTL0" acronym="CONTROLSS_ECAP7_ECCTL0" offset="0x24" width="32" description="">
		<bitfield id="SOCEVTSEL" width="2" begin="17" end="16" resetval="0x0" description="ADC SOC event select  Capture Mode: 00b (R/W) = SOC trigger source is CEVT1 01b (R/W) = SOC trigger source is CEVT2 10b (R/W) = SOC trigger source is CEVT3 11b (R/W) = SOC trigger source is CEVT4  APWM Mode: 00b (R/W) = SOC trigger interrupt source is period match 01b (R/W) = SOC trigger interrupt source is compare match 10b (R/W) = SOC trigger interrupt source is period match or compare match 11b (R/W) = Disabled" range="17 - 16" rwaccess="RW"/> 
		<bitfield id="QUALPRD" width="4" begin="15" end="12" resetval="0x0" description="Qual period to filter out noise on input signals being monitored, Not applicable for HR mode. 0x0 : Bypass 0x1 : pulses of with 1 cycle or less will be filtered out 0x2 : pulses of with 2 cycles or less will be filtered out .... 0xF : pulses of with 15 cycles or less will be filtered out" range="15 - 12" rwaccess="RW"/> 
		<bitfield id="INPUTSEL" width="8" begin="7" end="0" resetval="0x255" description="Capture input source select bits 0x0 capture input is ECAPxINPUT[0]  0x1 capture input is ECAPxINPUT[1]  0x2 capture input is ECAPxINPUT[2] ...  0xFF capture input is ECAPxINPUT[256]" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_ECAP7_ECCTL1" acronym="CONTROLSS_ECAP7_ECCTL1" offset="0x28" width="16" description="">
		<bitfield id="FREE_SOFT" width="2" begin="15" end="14" resetval="0x0" description="Emulation Control    0x0   |   ECAP_STOP_EMUTSCTR counter stops immediately on emulation suspend      0x1   |   ECAP_RUNS_UNTILTSCTR counter runs until = 0      0x2   |   ECAP_UNAF_EMU_SUSTSCTR counter is unaffected by emulation suspend (Run Free)      0x3   |   ECAP_UNAF_EMU_SUS2TSCTR counter is unaffected by emulation suspend (Run Free)  " range="15 - 14" rwaccess="RW"/> 
		<bitfield id="PRESCALE" width="5" begin="13" end="9" resetval="0x0" description="Event Filter prescale select    0x00   |   ECAP_DIV1Divide by 1 (i.e,. no prescale, by-pass the prescaler)      0x01   |   ECAP_DIV2Divide by 2      0x02   |   ECAP_DIV4Divide by 4      0x03   |   ECAP_DIV6Divide by 6      0x04   |   ECAP_DIV8Divide by 8      0x05   |   ECAP_DIV10Divide by 10      0x1E   |   ECAP_DIV60Divide by 60      0x1F   |   ECAP_DIV62Divide by 62  " range="13 - 9" rwaccess="RW"/> 
		<bitfield id="CAPLDEN" width="1" begin="8" end="8" resetval="0x0" description="Enable Loading of CAP1-4 registers on a capture event. Note that this bit does not disable CEVTn events from being generated.    0   |   ECAP_DISABLEDisable CAP1-4 register loads at capture event time.      1   |   ECAP_ENABLEEnable CAP1-4 register loads at capture event time.  " range="8" rwaccess="RW"/> 
		<bitfield id="CTRRST4" width="1" begin="7" end="7" resetval="0x0" description="Counter Reset on Capture Event 4    0   |   ECAP_DO_NOT_RESET_EVENT4Do not reset counter on Capture Event 4 (absolute time stamp operation)      1   |   ECAP_RESET_EVENT4Reset counter after Capture Event 4 time-stamp has been captured (used in difference mode operation)  " range="7" rwaccess="RW"/> 
		<bitfield id="CAP4POL" width="1" begin="6" end="6" resetval="0x0" description="Capture Event 4 Polarity select    0   |   ECAP_CAP_EVENT4_RISECapture Event 4 triggered on a rising edge (RE)      1   |   ECAP_CAP_EVENT4_FALLCapture Event 4 triggered on a falling edge (FE)  " range="6" rwaccess="RW"/> 
		<bitfield id="CTRRST3" width="1" begin="5" end="5" resetval="0x0" description="Counter Reset on Capture Event 3    0   |   ECAP_DO_NOT_RESET_EVENT3Do not reset counter on Capture Event 3 (absolute time stamp)      1   |   ECAP_RESET_EVENT3Reset counter after Event 3 time-stamp has been captured (used in difference mode operation)  " range="5" rwaccess="RW"/> 
		<bitfield id="CAP3POL" width="1" begin="4" end="4" resetval="0x0" description="Capture Event 3 Polarity select    0   |   ECAP_CAP_EVENT3_RISECapture Event 3 triggered on a rising edge (RE)      1   |   ECAP_CAP_EVENT3_FALLCapture Event 3 triggered on a falling edge (FE)  " range="4" rwaccess="RW"/> 
		<bitfield id="CTRRST2" width="1" begin="3" end="3" resetval="0x0" description="Counter Reset on Capture Event 2    0   |   ECAP_DO_NOT_RESET_EVENT2Do not reset counter on Capture Event 2 (absolute time stamp)      1   |   ECAP_RESET_EVENT2Reset counter after Event 2 time-stamp has been captured (used in difference mode operation)  " range="3" rwaccess="RW"/> 
		<bitfield id="CAP2POL" width="1" begin="2" end="2" resetval="0x0" description="Capture Event 2 Polarity select    0   |   ECAP_CAP_EVENT2_RISECapture Event 2 triggered on a rising edge (RE)      1   |   ECAP_CAP_EVENT2_FALLCapture Event 2 triggered on a falling edge (FE)  " range="2" rwaccess="RW"/> 
		<bitfield id="CTRRST1" width="1" begin="1" end="1" resetval="0x0" description="Counter Reset on Capture Event 1    0   |   ECAP_DO_NOT_RESET_EVENT1Do not reset counter on Capture Event 1 (absolute time stamp)      1   |   ECAP_RESET_EVENT1Reset counter after Event 1 time-stamp has been captured (used in difference mode operation)  " range="1" rwaccess="RW"/> 
		<bitfield id="CAP1POL" width="1" begin="0" end="0" resetval="0x0" description="Capture Event 1 Polarity select    0   |   ECAP_CAP_EVENT1_RISECapture Event 1 triggered on a rising edge (RE)      1   |   ECAP_CAP_EVENT1_FALLCapture Event 1 triggered on a falling edge (FE)  " range="0" rwaccess="RW"/>
	</register>
